ExperimentResults/multiple-producer-3-to-single-consumer.txt
40763 records sent, 8139.6 records/sec (7.76 MB/sec), 537.8 ms avg latency, 1636.0 ms max latency.
57866 records sent, 11561.6 records/sec (11.03 MB/sec), 309.0 ms avg latency, 1591.0 ms max latency.
50986 records sent, 10197.2 records/sec (9.72 MB/sec), 118.3 ms avg latency, 443.0 ms max latency.
22561 records sent, 4501.4 records/sec (4.29 MB/sec), 1317.1 ms avg latency, 3386.0 ms max latency.
20929 records sent, 4183.3 records/sec (3.99 MB/sec), 3735.1 ms avg latency, 6844.0 ms max latency.
22302 records sent, 4368.7 records/sec (4.17 MB/sec), 5775.7 ms avg latency, 10123.0 ms max latency.
28728 records sent, 5723.8 records/sec (5.46 MB/sec), 8451.0 ms avg latency, 13373.0 ms max latency.
24192 records sent, 4727.8 records/sec (4.51 MB/sec), 10321.7 ms avg latency, 16324.0 ms max latency.
37296 records sent, 7439.9 records/sec (7.10 MB/sec), 11153.6 ms avg latency, 17643.0 ms max latency.
30114 records sent, 5979.7 records/sec (5.70 MB/sec), 11389.4 ms avg latency, 17747.0 ms max latency.
33138 records sent, 6455.9 records/sec (6.16 MB/sec), 10226.4 ms avg latency, 16521.0 ms max latency.
42588 records sent, 6834.9 records/sec (6.52 MB/sec), 9711.2 ms avg latency, 16089.0 ms max latency.
25326 records sent, 5048.0 records/sec (4.81 MB/sec), 10116.1 ms avg latency, 16613.0 ms max latency.
30240 records sent, 6032.3 records/sec (5.75 MB/sec), 11226.1 ms avg latency, 17610.0 ms max latency.
24696 records sent, 4154.1 records/sec (3.96 MB/sec), 11957.5 ms avg latency, 19077.0 ms max latency.
24948 records sent, 4679.8 records/sec (4.46 MB/sec), 12755.9 ms avg latency, 21125.0 ms max latency.
30114 records sent, 6020.4 records/sec (5.74 MB/sec), 13783.5 ms avg latency, 23010.0 ms max latency.
35721 records sent, 7137.1 records/sec (6.81 MB/sec), 12041.5 ms avg latency, 20717.0 ms max latency.
41328 records sent, 8247.5 records/sec (7.87 MB/sec), 10565.4 ms avg latency, 18805.0 ms max latency.
25578 records sent, 4956.0 records/sec (4.73 MB/sec), 8713.7 ms avg latency, 15548.0 ms max latency.
19845 records sent, 3967.4 records/sec (3.78 MB/sec), 11281.5 ms avg latency, 18244.0 ms max latency.
23436 records sent, 4587.2 records/sec (4.37 MB/sec), 11601.2 ms avg latency, 19161.0 ms max latency.
31815 records sent, 5622.0 records/sec (5.36 MB/sec), 12824.7 ms avg latency, 20650.0 ms max latency.
40139 records sent, 7945.2 records/sec (7.58 MB/sec), 12740.3 ms avg latency, 21917.0 ms max latency.
36726 records sent, 7324.7 records/sec (6.99 MB/sec), 10155.8 ms avg latency, 17504.0 ms max latency.
22389 records sent, 4475.1 records/sec (4.27 MB/sec), 12462.2 ms avg latency, 15393.0 ms max latency.
32236 records sent, 6424.1 records/sec (6.13 MB/sec), 11779.4 ms avg latency, 15298.0 ms max latency.
39490 records sent, 7891.7 records/sec (7.53 MB/sec), 11195.0 ms avg latency, 15490.0 ms max latency.
46770 records sent, 9090.4 records/sec (8.67 MB/sec), 8048.1 ms avg latency, 12238.0 ms max latency.
52159 records sent, 10347.0 records/sec (9.87 MB/sec), 5787.1 ms avg latency, 10132.0 ms max latency.
51724 records sent, 10342.7 records/sec (9.86 MB/sec), 6311.1 ms avg latency, 11050.0 ms max latency.
26712 records sent, 5160.7 records/sec (4.92 MB/sec), 7168.6 ms avg latency, 11515.0 ms max latency.
25704 records sent, 5140.8 records/sec (4.90 MB/sec), 9825.7 ms avg latency, 17374.0 ms max latency.
32572 records sent, 6506.6 records/sec (6.21 MB/sec), 10369.5 ms avg latency, 19023.0 ms max latency.
29627 records sent, 5602.7 records/sec (5.34 MB/sec), 11353.9 ms avg latency, 20975.0 ms max latency.
14963 records sent, 2837.1 records/sec (2.71 MB/sec), 11170.3 ms avg latency, 24791.0 ms max latency.
42224 records sent, 8421.2 records/sec (8.03 MB/sec), 13840.1 ms avg latency, 24997.0 ms max latency.
47628 records sent, 9489.5 records/sec (9.05 MB/sec), 9938.7 ms avg latency, 19353.0 ms max latency.
53298 records sent, 10385.4 records/sec (9.90 MB/sec), 7122.7 ms avg latency, 16654.0 ms max latency.
49392 records sent, 9878.4 records/sec (9.42 MB/sec), 6637.2 ms avg latency, 11416.0 ms max latency.
46998 records sent, 9386.5 records/sec (8.95 MB/sec), 6971.8 ms avg latency, 11992.0 ms max latency.
52416 records sent, 10458.1 records/sec (9.97 MB/sec), 6719.2 ms avg latency, 11928.0 ms max latency.
35280 records sent, 7056.0 records/sec (6.73 MB/sec), 7707.9 ms avg latency, 13173.0 ms max latency.
65016 records sent, 12959.1 records/sec (12.36 MB/sec), 6284.2 ms avg latency, 12410.0 ms max latency.
5796 records sent, 964.7 records/sec (0.92 MB/sec), 7091.3 ms avg latency, 15213.0 ms max latency.
6048 records sent, 1066.5 records/sec (1.02 MB/sec), 13195.2 ms avg latency, 19193.0 ms max latency.
15120 records sent, 3022.8 records/sec (2.88 MB/sec), 17828.7 ms avg latency, 24592.0 ms max latency.
28098 records sent, 5560.7 records/sec (5.30 MB/sec), 15707.0 ms avg latency, 26164.0 ms max latency.
22932 records sent, 4534.7 records/sec (4.32 MB/sec), 17578.2 ms avg latency, 29533.0 ms max latency.
32760 records sent, 6545.5 records/sec (6.24 MB/sec), 15667.2 ms avg latency, 32665.0 ms max latency.
44730 records sent, 8903.3 records/sec (8.49 MB/sec), 12008.6 ms avg latency, 33075.0 ms max latency.
36792 records sent, 7311.6 records/sec (6.97 MB/sec), 8719.2 ms avg latency, 19119.0 ms max latency.
36666 records sent, 7321.5 records/sec (6.98 MB/sec), 8448.9 ms avg latency, 16847.0 ms max latency.
36666 records sent, 7318.6 records/sec (6.98 MB/sec), 8744.1 ms avg latency, 16138.0 ms max latency.
31626 records sent, 6302.5 records/sec (6.01 MB/sec), 9106.6 ms avg latency, 18363.0 ms max latency.
35028 records sent, 7005.6 records/sec (6.68 MB/sec), 9581.0 ms avg latency, 18812.0 ms max latency.
35910 records sent, 7166.2 records/sec (6.83 MB/sec), 9693.3 ms avg latency, 18695.0 ms max latency.
32382 records sent, 6460.9 records/sec (6.16 MB/sec), 9872.7 ms avg latency, 18451.0 ms max latency.
7182 records sent, 1231.5 records/sec (1.17 MB/sec), 10919.8 ms avg latency, 20340.0 ms max latency.
5422 records sent, 1073.5 records/sec (1.02 MB/sec), 9172.3 ms avg latency, 26912.0 ms max latency.
29274 records sent, 5817.6 records/sec (5.55 MB/sec), 17790.8 ms avg latency, 27582.0 ms max latency.
38054 records sent, 7607.8 records/sec (7.26 MB/sec), 16029.0 ms avg latency, 27208.0 ms max latency.
33731 records sent, 6734.1 records/sec (6.42 MB/sec), 13751.0 ms avg latency, 28349.0 ms max latency.
43722 records sent, 8697.4 records/sec (8.29 MB/sec), 9248.4 ms avg latency, 27369.0 ms max latency.
40698 records sent, 8136.3 records/sec (7.76 MB/sec), 8177.7 ms avg latency, 15721.0 ms max latency.
37296 records sent, 7431.0 records/sec (7.09 MB/sec), 8129.6 ms avg latency, 15611.0 ms max latency.
14868 records sent, 2798.4 records/sec (2.67 MB/sec), 10545.9 ms avg latency, 17841.0 ms max latency.
6048 records sent, 1201.4 records/sec (1.15 MB/sec), 14765.7 ms avg latency, 22611.0 ms max latency.
10080 records sent, 1670.5 records/sec (1.59 MB/sec), 15598.2 ms avg latency, 24442.0 ms max latency.
5670 records sent, 1094.6 records/sec (1.04 MB/sec), 20132.9 ms avg latency, 32402.0 ms max latency.
45297 records sent, 8850.5 records/sec (8.44 MB/sec), 17867.3 ms avg latency, 32608.0 ms max latency.
21672 records sent, 4167.7 records/sec (3.97 MB/sec), 17918.1 ms avg latency, 34076.0 ms max latency.
4410 records sent, 845.5 records/sec (0.81 MB/sec), 18407.7 ms avg latency, 37282.0 ms max latency.
12600 records sent, 2508.5 records/sec (2.39 MB/sec), 23092.0 ms avg latency, 42294.0 ms max latency.
20223 records sent, 3971.5 records/sec (3.79 MB/sec), 20411.1 ms avg latency, 41501.0 ms max latency.
6867 records sent, 1318.5 records/sec (1.26 MB/sec), 24560.5 ms avg latency, 39865.0 ms max latency.
18711 records sent, 3727.3 records/sec (3.55 MB/sec), 20745.6 ms avg latency, 40074.0 ms max latency.
9009 records sent, 1789.3 records/sec (1.71 MB/sec), 22299.2 ms avg latency, 39865.0 ms max latency.
12348 records sent, 2463.2 records/sec (2.35 MB/sec), 23990.4 ms avg latency, 43938.0 ms max latency.
2142 records sent, 290.8 records/sec (0.28 MB/sec), 23286.9 ms avg latency, 51238.0 ms max latency.
5418 records sent, 1022.8 records/sec (0.98 MB/sec), 29153.7 ms avg latency, 56026.0 ms max latency.
2016 records sent, 387.4 records/sec (0.37 MB/sec), 35493.8 ms avg latency, 60266.0 ms max latency.
2394 records sent, 472.9 records/sec (0.45 MB/sec), 40412.7 ms avg latency, 65408.0 ms max latency.
3906 records sent, 718.0 records/sec (0.68 MB/sec), 40182.0 ms avg latency, 70054.0 ms max latency.
4536 records sent, 874.3 records/sec (0.83 MB/sec), 44040.5 ms avg latency, 73501.0 ms max latency.
1764 records sent, 305.6 records/sec (0.29 MB/sec), 47568.9 ms avg latency, 75961.0 ms max latency.
9135 records sent, 1801.8 records/sec (1.72 MB/sec), 49499.0 ms avg latency, 81598.0 ms max latency.
12621 records sent, 2522.2 records/sec (2.41 MB/sec), 47577.8 ms avg latency, 83838.0 ms max latency.
13106 records sent, 2592.2 records/sec (2.47 MB/sec), 47615.5 ms avg latency, 79691.0 ms max latency.
13483 records sent, 2683.7 records/sec (2.56 MB/sec), 45001.9 ms avg latency, 82992.0 ms max latency.
16956 records sent, 3371.6 records/sec (3.22 MB/sec), 41307.8 ms avg latency, 83242.0 ms max latency.
18270 records sent, 3598.6 records/sec (3.43 MB/sec), 38519.0 ms avg latency, 81707.0 ms max latency.
11592 records sent, 2253.9 records/sec (2.15 MB/sec), 33378.0 ms avg latency, 80237.0 ms max latency.
17451 records sent, 3383.3 records/sec (3.23 MB/sec), 30372.9 ms avg latency, 78375.0 ms max latency.
13569 records sent, 2678.4 records/sec (2.55 MB/sec), 25266.4 ms avg latency, 57612.0 ms max latency.
12746 records sent, 2546.7 records/sec (2.43 MB/sec), 29607.4 ms avg latency, 44100.0 ms max latency.
9772 records sent, 1951.3 records/sec (1.86 MB/sec), 29140.1 ms avg latency, 43045.0 ms max latency.
20266 records sent, 3844.1 records/sec (3.67 MB/sec), 27851.7 ms avg latency, 41349.0 ms max latency.
16250 records sent, 3247.4 records/sec (3.10 MB/sec), 25383.8 ms avg latency, 38056.0 ms max latency.
12304 records sent, 2460.8 records/sec (2.35 MB/sec), 23272.1 ms avg latency, 36429.0 ms max latency.
15748 records sent, 2980.9 records/sec (2.84 MB/sec), 23006.2 ms avg latency, 34325.0 ms max latency.
19529 records sent, 3904.2 records/sec (3.72 MB/sec), 20173.2 ms avg latency, 34234.0 ms max latency.
8798 records sent, 1754.0 records/sec (1.67 MB/sec), 22646.9 ms avg latency, 32865.0 ms max latency.
14367 records sent, 2842.1 records/sec (2.71 MB/sec), 23344.6 ms avg latency, 32776.0 ms max latency.
9278 records sent, 565.5 records/sec (0.54 MB/sec), 24456.2 ms avg latency, 35410.0 ms max latency.
28751 records sent, 5745.6 records/sec (5.48 MB/sec), 26758.1 ms avg latency, 46559.0 ms max latency.
10080 records sent, 1930.7 records/sec (1.84 MB/sec), 24565.4 ms avg latency, 45570.0 ms max latency.
10656 records sent, 2108.0 records/sec (2.01 MB/sec), 30511.1 ms avg latency, 48791.0 ms max latency.
37507 records sent, 7185.2 records/sec (6.85 MB/sec), 27058.7 ms avg latency, 48127.0 ms max latency.
46918 records sent, 9381.7 records/sec (8.95 MB/sec), 15878.6 ms avg latency, 42614.0 ms max latency.
44226 records sent, 8841.7 records/sec (8.43 MB/sec), 7932.5 ms avg latency, 23871.0 ms max latency.
50730 records sent, 10103.6 records/sec (9.64 MB/sec), 6912.5 ms avg latency, 13911.0 ms max latency.
23605 records sent, 4714.4 records/sec (4.50 MB/sec), 8672.3 ms avg latency, 16239.0 ms max latency.
18530 records sent, 3689.8 records/sec (3.52 MB/sec), 12371.9 ms avg latency, 18731.0 ms max latency.
23799 records sent, 4750.3 records/sec (4.53 MB/sec), 14218.2 ms avg latency, 20295.0 ms max latency.
35748 records sent, 7146.7 records/sec (6.82 MB/sec), 12855.0 ms avg latency, 21022.0 ms max latency.
25709 records sent, 4665.0 records/sec (4.45 MB/sec), 10563.1 ms avg latency, 22012.0 ms max latency.
54041 records sent, 10806.0 records/sec (10.31 MB/sec), 10155.4 ms avg latency, 21990.0 ms max latency.
33821 records sent, 6746.7 records/sec (6.43 MB/sec), 8460.6 ms avg latency, 15179.0 ms max latency.
36828 records sent, 7343.6 records/sec (7.00 MB/sec), 7934.6 ms avg latency, 15163.0 ms max latency.
12637 records sent, 2519.3 records/sec (2.40 MB/sec), 10965.5 ms avg latency, 17953.0 ms max latency.
2600 records sent, 496.6 records/sec (0.47 MB/sec), 14620.8 ms avg latency, 22630.0 ms max latency.
5787 records sent, 1139.8 records/sec (1.09 MB/sec), 17748.1 ms avg latency, 27230.0 ms max latency.
23094 records sent, 4613.3 records/sec (4.40 MB/sec), 21844.8 ms avg latency, 29699.0 ms max latency.
32204 records sent, 6343.1 records/sec (6.05 MB/sec), 18839.7 ms avg latency, 30440.0 ms max latency.
35286 records sent, 6894.5 records/sec (6.58 MB/sec), 14999.9 ms avg latency, 31294.0 ms max latency.
36726 records sent, 7305.7 records/sec (6.97 MB/sec), 10810.9 ms avg latency, 32822.0 ms max latency.
33349 records sent, 6419.4 records/sec (6.12 MB/sec), 9659.8 ms avg latency, 18849.0 ms max latency.
36265 records sent, 7229.9 records/sec (6.89 MB/sec), 8451.2 ms avg latency, 19213.0 ms max latency.
13608 records sent, 2718.9 records/sec (2.59 MB/sec), 10610.8 ms avg latency, 22700.0 ms max latency.
13860 records sent, 2753.3 records/sec (2.63 MB/sec), 12916.1 ms avg latency, 26359.0 ms max latency.
16632 records sent, 2220.3 records/sec (2.12 MB/sec), 15017.0 ms avg latency, 28971.0 ms max latency.
52431 records sent, 10446.5 records/sec (9.96 MB/sec), 15159.7 ms avg latency, 33414.0 ms max latency.
40693 records sent, 7810.6 records/sec (7.45 MB/sec), 12036.1 ms avg latency, 31329.0 ms max latency.
41387 records sent, 8272.4 records/sec (7.89 MB/sec), 9652.1 ms avg latency, 30253.0 ms max latency.
32823 records sent, 6400.7 records/sec (6.10 MB/sec), 7974.3 ms avg latency, 20937.0 ms max latency.
34311 records sent, 6860.8 records/sec (6.54 MB/sec), 8655.1 ms avg latency, 20025.0 ms max latency.
19751 records sent, 3918.8 records/sec (3.74 MB/sec), 12842.0 ms avg latency, 21914.0 ms max latency.
27114 records sent, 5422.8 records/sec (5.17 MB/sec), 12462.6 ms avg latency, 22954.0 ms max latency.
30933 records sent, 6152.1 records/sec (5.87 MB/sec), 11792.9 ms avg latency, 23966.0 ms max latency.
28728 records sent, 5733.0 records/sec (5.47 MB/sec), 10911.0 ms avg latency, 24822.0 ms max latency.
13608 records sent, 2149.1 records/sec (2.05 MB/sec), 11277.9 ms avg latency, 28492.0 ms max latency.
24318 records sent, 4692.8 records/sec (4.48 MB/sec), 19171.7 ms avg latency, 29726.0 ms max latency.
45612 records sent, 9082.4 records/sec (8.66 MB/sec), 11546.6 ms avg latency, 28564.0 ms max latency.
31878 records sent, 6311.2 records/sec (6.02 MB/sec), 11091.3 ms avg latency, 27563.0 ms max latency.
2394 records sent, 387.3 records/sec (0.37 MB/sec), 10974.1 ms avg latency, 28568.0 ms max latency.
33894 records sent, 6770.7 records/sec (6.46 MB/sec), 15637.2 ms avg latency, 33855.0 ms max latency.
27846 records sent, 5538.2 records/sec (5.28 MB/sec), 12874.2 ms avg latency, 31291.0 ms max latency.
24066 records sent, 4804.6 records/sec (4.58 MB/sec), 13885.6 ms avg latency, 29400.0 ms max latency.
25830 records sent, 4954.9 records/sec (4.73 MB/sec), 14967.1 ms avg latency, 30621.0 ms max latency.
47250 records sent, 9444.3 records/sec (9.01 MB/sec), 11556.7 ms avg latency, 30261.0 ms max latency.
37926 records sent, 7514.6 records/sec (7.17 MB/sec), 9453.0 ms avg latency, 22756.0 ms max latency.
12096 records sent, 2407.6 records/sec (2.30 MB/sec), 9520.6 ms avg latency, 24050.0 ms max latency.
28681 records sent, 5731.6 records/sec (5.47 MB/sec), 11775.4 ms avg latency, 26448.0 ms max latency.
38300 records sent, 7660.0 records/sec (7.31 MB/sec), 11238.6 ms avg latency, 25119.0 ms max latency.
26712 records sent, 5319.0 records/sec (5.07 MB/sec), 10170.7 ms avg latency, 26426.0 ms max latency.
21168 records sent, 4217.6 records/sec (4.02 MB/sec), 12464.6 ms avg latency, 28431.0 ms max latency.
33894 records sent, 6777.4 records/sec (6.46 MB/sec), 12509.8 ms avg latency, 29039.0 ms max latency.
35028 records sent, 6990.2 records/sec (6.67 MB/sec), 10704.9 ms avg latency, 28642.0 ms max latency.
39060 records sent, 7767.0 records/sec (7.41 MB/sec), 9906.0 ms avg latency, 25117.0 ms max latency.
48006 records sent, 9597.4 records/sec (9.15 MB/sec), 8389.3 ms avg latency, 24491.0 ms max latency.
33012 records sent, 6557.8 records/sec (6.25 MB/sec), 7976.7 ms avg latency, 18898.0 ms max latency.
36061 records sent, 7192.1 records/sec (6.86 MB/sec), 8102.3 ms avg latency, 20180.0 ms max latency.
30558 records sent, 6106.7 records/sec (5.82 MB/sec), 8472.7 ms avg latency, 21901.0 ms max latency.
30556 records sent, 6009.0 records/sec (5.73 MB/sec), 9774.9 ms avg latency, 23668.0 ms max latency.
15750 records sent, 2602.4 records/sec (2.48 MB/sec), 10656.0 ms avg latency, 24488.0 ms max latency.
252 records sent, 43.4 records/sec (0.04 MB/sec), 15153.4 ms avg latency, 29158.0 ms max latency.
75875 records sent, 15162.9 records/sec (14.46 MB/sec), 14050.0 ms avg latency, 34817.0 ms max latency.
48006 records sent, 9403.7 records/sec (8.97 MB/sec), 8155.9 ms avg latency, 27983.0 ms max latency.
37738 records sent, 7540.1 records/sec (7.19 MB/sec), 7994.0 ms avg latency, 25584.0 ms max latency.
12852 records sent, 2554.1 records/sec (2.44 MB/sec), 8172.0 ms avg latency, 24577.0 ms max latency.
7056 records sent, 1317.9 records/sec (1.26 MB/sec), 10134.4 ms avg latency, 20228.0 ms max latency.
16386 records sent, 3275.9 records/sec (3.12 MB/sec), 14072.4 ms avg latency, 27632.0 ms max latency.
21891 records sent, 4180.9 records/sec (3.99 MB/sec), 15784.6 ms avg latency, 30879.0 ms max latency.
20091 records sent, 4014.2 records/sec (3.83 MB/sec), 17237.6 ms avg latency, 35233.0 ms max latency.
25584 records sent, 5116.8 records/sec (4.88 MB/sec), 17525.2 ms avg latency, 37937.0 ms max latency.
30594 records sent, 5898.2 records/sec (5.62 MB/sec), 16239.1 ms avg latency, 37745.0 ms max latency.
34272 records sent, 6705.5 records/sec (6.39 MB/sec), 12332.4 ms avg latency, 37938.0 ms max latency.
29106 records sent, 5806.1 records/sec (5.54 MB/sec), 10641.8 ms avg latency, 34339.0 ms max latency.
24948 records sent, 4736.7 records/sec (4.52 MB/sec), 11538.0 ms avg latency, 29886.0 ms max latency.
29169 records sent, 5832.6 records/sec (5.56 MB/sec), 10842.3 ms avg latency, 27998.0 ms max latency.
21798 records sent, 4224.4 records/sec (4.03 MB/sec), 11365.4 ms avg latency, 29799.0 ms max latency.
3780 records sent, 677.9 records/sec (0.65 MB/sec), 14297.1 ms avg latency, 34015.0 ms max latency.
1512 records sent, 294.1 records/sec (0.28 MB/sec), 19373.2 ms avg latency, 38600.0 ms max latency.
756 records sent, 150.6 records/sec (0.14 MB/sec), 23519.3 ms avg latency, 41872.0 ms max latency.
378 records sent, 40.5 records/sec (0.04 MB/sec), 29475.2 ms avg latency, 49816.0 ms max latency.
20730 records sent, 4146.0 records/sec (3.95 MB/sec), 22285.7 ms avg latency, 58209.0 ms max latency.
41580 records sent, 8281.2 records/sec (7.90 MB/sec), 43660.1 ms avg latency, 58211.0 ms max latency.
5000000 records sent, 5022.016520 records/sec (4.79 MB/sec), 12725.78 ms avg latency, 83838.00 ms max latency, 10543 ms 50th, 34366 ms 95th, 64127 ms 99th, 82151 ms 99.9th.